t_kawahala=[];
t_kuo=[];
%test3
st=cputime;
g=Gtest3();
G=Network(g,-1,1);
X=[1, 2, 6, 3, 7, 9, 4, 10, 12, 5, 8, 11, 13, 14];
doKawahara(G,X);
t_kawahala=[t_kawahala,cputime-st];


%test5
st=cputime;
g=Gtest5();
G=Network(g,-1,1);
X=[1, 2, 3, 4, 17, 23, 5, 18, 26, 6, 19, 7, 20, 31, 8, 21, 24, 9, 16, 25, 29, 10, 27, 11, 12, 32, 36, 13, 28, 14, 22, 30, 33, 37, 38, 39, 15, 34, 35, 40];
doKawahara(G,X);
t_kawahala=[t_kawahala,cputime-st];




%test4
st=cputime;
g=Gtest4();
G=Network(g,-1,1);
X=[1, 2, 3, 4, 5, 6, 7, 8, 25, 27, 9, 21, 28, 10, 11, 34, 37, 12, 35, 40, 13, 14, 22, 26, 29, 32, 41, 43, 15, 38, 44, 16, 23, 42, 47, 17, 33, 36, 39, 45, 18, 24, 50, 19, 46, 48, 20, 30, 31, 49];
doKawahara(G,X);
t_kawahala=[t_kawahala,cputime-st];

%test2
st=cputime;
g=Gtest2();
G=Network(g,-1,1);
X=[1, 2, 3, 4, 5, 29, 6, 7, 26, 8, 9, 10, 40, 11, 42, 46, 12, 13, 30, 33, 14, 31, 50, 15, 35, 16, 43, 17, 36, 18, 27, 32, 37, 39, 41, 19, 49, 58, 20, 55, 56, 21, 53, 22, 28, 44, 48, 54, 57, 23, 34, 51, 59, 24, 38, 45, 47, 52, 25, 60];
doKawahara(G,X);
t_kawahala=[t_kawahala,cputime-st];

%test1
st=cputime;
g=Gtest1();
G=Network(g,-1,1);
X=[1, 2, 3, 21, 4, 5, 6, 7, 26, 8, 22, 23, 29, 9, 24, 30, 10, 36, 11, 12, 27, 34, 37, 13, 31, 44, 14, 41, 45, 15, 16, 42, 17, 28, 32, 48, 18, 33, 35, 38, 43, 46, 19, 25, 39, 47, 49, 20, 40, 50];
doKawahara(G,X);
t_kawahala=[t_kawahala,cputime-st];





%test6
st=cputime;
g=Gtest6();
G=Network(g,-1,1);
X=[1, 2, 3, 4, 5, 35, 6, 7, 41, 8, 9, 10, 31, 43, 11, 36, 12, 42, 13, 46, 14, 47, 50, 53, 15, 32, 16, 37, 54, 17, 51, 18, 33, 19, 38, 44, 48, 57, 20, 62, 65, 21, 66, 22, 55, 23, 39, 49, 56, 58, 24, 63, 25, 40, 52, 60, 26, 27, 69, 28, 34, 45, 61, 67, 29, 64, 68, 30, 59, 70];
doKawahara(G,X);
t_kawahala=[t_kawahala,cputime-st];





x=1:1:6;%x轴上的数据，第一个值代表数据开始，第二个值代表间隔，第三个值代表终止
plot(x,t_kawahala,'-*b'); %线性，颜色，标记
axis([0,6,0,10])  %确定x轴与y轴框图大小
set(gca,'XTick',[0:1:6]) %x轴范围1-6，间隔1
set(gca,'YTick',[0:1:10]) %y轴范围0-700，间隔100
legend('kawahara');   %右上角标注
xlabel('数据集')  %x轴坐标描述
ylabel('时间（s）') %y轴坐标描述